devdnl/dnx-rtos/src/system/drivers/dma/stm32f4/dma.c
/*==============================================================================
File     dma.c

Author   Daniel Zorychta

Brief    General usage DMA driver.

         Copyright (C) 2017 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32f4/dma_ddi.h"
#include "stm32f4/stm32f4xx.h"
#include "../dma_ioctl.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define DMA_COUNT                       2
#define STREAM_COUNT                    8

#define DMAD(major, stream, ID)         (((ID) << 4) | (((stream) & 7) << 1) | ((major) & 1))
#define GETMAJOR(DMAD)                  (((DMAD) >> 0) & 1)
#define GETSTREAM(DMAD)                 (((DMAD) >> 1) & 7)

#define M2M_TRANSFER_TIMEOUT            5000

/*==============================================================================
  Local object types
==============================================================================*/
typedef struct {
        DMA_TypeDef        *DMA;
        DMA_Stream_TypeDef *stream[STREAM_COUNT];
        IRQn_Type           IRQn[STREAM_COUNT];
} DMA_HW_t;

typedef struct {
        void           *arg;
        _DMA_cb_t       callback;
        u32_t           dmad;
        bool            release;
} DMA_RT_stream_t;

typedef struct {
        DMA_RT_stream_t stream[STREAM_COUNT];
        queue_t       **queue;
        u32_t           ID_cnt;
        u8_t            major;
} DMA_RT_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void clear_DMA_IRQ_flags(u8_t major, u8_t stream);
static bool M2M_callback(DMA_Stream_TypeDef *stream, u8_t SR, void *arg);

/*==============================================================================
  Local object
==============================================================================*/
MODULE_NAME(DMA);

static const DMA_HW_t DMA_HW[] = {
        {
                .DMA       = DMA1,
                .stream[0] = DMA1_Stream0,
                .stream[1] = DMA1_Stream1,
                .stream[2] = DMA1_Stream2,
                .stream[3] = DMA1_Stream3,
                .stream[4] = DMA1_Stream4,
                .stream[5] = DMA1_Stream5,
                .stream[6] = DMA1_Stream6,
                .stream[7] = DMA1_Stream7,
                .IRQn[0]   = DMA1_Stream0_IRQn,
                .IRQn[1]   = DMA1_Stream1_IRQn,
                .IRQn[2]   = DMA1_Stream2_IRQn,
                .IRQn[3]   = DMA1_Stream3_IRQn,
                .IRQn[4]   = DMA1_Stream4_IRQn,
                .IRQn[5]   = DMA1_Stream5_IRQn,
                .IRQn[6]   = DMA1_Stream6_IRQn,
                .IRQn[7]   = DMA1_Stream7_IRQn,
        },
        {
                .DMA       = DMA2,
                .stream[0] = DMA2_Stream0,
                .stream[1] = DMA2_Stream1,
                .stream[2] = DMA2_Stream2,
                .stream[3] = DMA2_Stream3,
                .stream[4] = DMA2_Stream4,
                .stream[5] = DMA2_Stream5,
                .stream[6] = DMA2_Stream6,
                .stream[7] = DMA2_Stream7,
                .IRQn[0]   = DMA2_Stream0_IRQn,
                .IRQn[1]   = DMA2_Stream1_IRQn,
                .IRQn[2]   = DMA2_Stream2_IRQn,
                .IRQn[3]   = DMA2_Stream3_IRQn,
                .IRQn[4]   = DMA2_Stream4_IRQn,
                .IRQn[5]   = DMA2_Stream5_IRQn,
                .IRQn[6]   = DMA2_Stream6_IRQn,
                .IRQn[7]   = DMA2_Stream7_IRQn,
        },
};

static DMA_RT_t *DMA_RT[DMA_COUNT];

/*==============================================================================
  Exported object
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device.
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_INIT(DMA, void **device_handle, u8_t major, u8_t minor)
{
        int err = EFAULT;

        if (major < DMA_COUNT && minor == 0) {
                err = sys_zalloc(sizeof(DMA_RT_t), device_handle);
                if (!err) {
                        /*
                         * Only the DMA2 controller is able to perform
                         * memory-to-memory transfers. It is a peripheral limitation.
                         * Allocating memory for memory-to-memory semaphores.
                         */
                        if (major == 1) {
                                DMA_RT_t *hdl = *device_handle;
                                err = sys_zalloc(sizeof(queue_t*) * STREAM_COUNT,
                                                 cast(void*, &hdl->queue));
                                if (err) {
                                        sys_free(device_handle);
                                }
                        }

                        if (!err) {
                                /*
                                 * NOTE: DMA1EN and DMA2EN are localized in this same
                                 *       register and DMA2EN is shifted by 1 bit relative
                                 *       to DMA1EN.
                                 */
                                RCC->AHB1ENR |= (RCC_AHB1ENR_DMA1EN << major);

                                DMA_RT[major] = *device_handle;
                                DMA_RT[major]->major = major;
                                DMA_RT[major]->ID_cnt++;
                        }
                }
        }

