devdnl/dnx-rtos/src/system/drivers/dma/stm32f4/dma.c
        return err;
}

//==============================================================================
/**
 * @brief Flush device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_FLUSH(DMA, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_STAT(DMA, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG1(device_handle);

        device_stat->st_size = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief Function allocate selected stream.
 *
 * @param [in]  major         DMA peripheral number.
 * @param [in]  stream        stream number.
 *
 * @return On success DMA descriptor number, otherwise 0.
 */
//==============================================================================
u32_t _DMA_DDI_reserve(u8_t major, u8_t stream)
{
        int dmad = 0;

        if (DMA_RT[major] == NULL) {
                printk("DMA%d: not initialized", major + 1);
                return dmad;
        }

        if (major < DMA_COUNT && stream < STREAM_COUNT) {
                sys_critical_section_begin();
                {
                        if (DMA_RT[major]->stream[stream].dmad == 0) {
                                u32_t ID = DMA_RT[major]->ID_cnt++;

                                dmad = DMAD(major, stream, ID);

                                DMA_RT[major]->stream[stream].dmad = dmad;

                                if (DMA_RT[major]->ID_cnt == 0) {
                                        DMA_RT[major]->ID_cnt++;
                                }
                        }
                }
                sys_critical_section_end();
        }

        return dmad;
}

//==============================================================================
/**
 * @brief Function free allocated stream.
 *
 * @param dmad                  DMA descriptor.
 */
//==============================================================================
void _DMA_DDI_release(u32_t dmad)
{
        if (dmad && DMA_RT[GETMAJOR(dmad)]) {
                DMA_RT_stream_t *RT_stream = &DMA_RT[GETMAJOR(dmad)]->stream[GETSTREAM(dmad)];

                if (RT_stream->dmad == dmad) {

                        DMA_Stream_TypeDef *DMA_Stream = DMA_HW[GETMAJOR(dmad)].stream[GETSTREAM(dmad)];

                        RT_stream->callback = NULL;
                        DMA_Stream->CR      = 0;

                        clear_DMA_IRQ_flags(GETMAJOR(dmad), GETSTREAM(dmad));

                        DMA_Stream->M0AR = 0;
                        DMA_Stream->M1AR = 0;
                        DMA_Stream->NDTR = 0;
                        DMA_Stream->PAR  = 0;

                        memset(RT_stream, 0, sizeof(DMA_RT_stream_t));
                }
        }
}

//==============================================================================
/**
 * @brief Function start transfer. The IRQ flags (TCIE, TEIE) are added
 *        automatically.
 *
 * @param dmad                  DMA descriptor.
 * @param config                DMA configuration.
 *
 * @return One of errno value.
 */
//==============================================================================
int _DMA_DDI_transfer(u32_t dmad, _DMA_DDI_config_t *config)
{
        int err = EINVAL;

        if (  dmad
           && DMA_RT[GETMAJOR(dmad)]
           && config
           && config->NDT
           && config->PA
           && (config->MA[0] || config->MA[1])) {

                DMA_RT_stream_t    *RT_stream  = &DMA_RT[GETMAJOR(dmad)]->stream[GETSTREAM(dmad)];
                DMA_Stream_TypeDef *DMA_Stream =  DMA_HW[GETMAJOR(dmad)].stream[GETSTREAM(dmad)];
                IRQn_Type           IRQn       =  DMA_HW[GETMAJOR(dmad)].IRQn[GETSTREAM(dmad)];

                if (RT_stream->dmad == dmad) {
                        DMA_Stream->CR = 0;
                        clear_DMA_IRQ_flags(GETMAJOR(dmad), GETSTREAM(dmad));

                        DMA_Stream->M0AR = config->MA[0];
                        DMA_Stream->M1AR = config->MA[1];
                        DMA_Stream->NDTR = config->NDT;
                        DMA_Stream->PAR  = config->PA;
                        DMA_Stream->CR   = config->CR & ~DMA_SxCR_EN;
                        DMA_Stream->FCR  = config->FC;

                        RT_stream->arg      = config->arg;
                        RT_stream->callback = config->callback;
                        RT_stream->release  = config->release;

                        clear_DMA_IRQ_flags(GETMAJOR(dmad), GETSTREAM(dmad));
                        NVIC_SetPriority(IRQn, config->IRQ_priority);
                        NVIC_EnableIRQ(IRQn);

                        SET_BIT(DMA_Stream->CR, DMA_SxCR_TCIE | DMA_SxCR_TEIE);
                        SET_BIT(DMA_Stream->CR, DMA_SxCR_EN);

                        err = ESUCC;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function clear flags for selected DMA and stream.
 *
 * @param  major        DMA number
 * @param  stream       stream number
 */
//==============================================================================
static void clear_DMA_IRQ_flags(u8_t major, u8_t stream)
{
        static const struct {
                char  reg;
                u32_t mask;
        } flag[] = {
                    {.reg = 'L', .mask = (DMA_LIFCR_CFEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CHTIF0 | DMA_LIFCR_CTCIF0)},
                    {.reg = 'L', .mask = (DMA_LIFCR_CFEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTCIF1)},
                    {.reg = 'L', .mask = (DMA_LIFCR_CFEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTCIF2)},
                    {.reg = 'L', .mask = (DMA_LIFCR_CFEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTCIF3)},
                    {.reg = 'H', .mask = (DMA_HIFCR_CFEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTCIF4)},
                    {.reg = 'H', .mask = (DMA_HIFCR_CFEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTCIF5)},
                    {.reg = 'H', .mask = (DMA_HIFCR_CFEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTCIF6)},
                    {.reg = 'H', .mask = (DMA_HIFCR_CFEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTCIF7)},
        };

        if (flag[stream].reg == 'L') {
                DMA_HW[major].DMA->LIFCR = flag[stream].mask;
        } else {
                DMA_HW[major].DMA->HIFCR = flag[stream].mask;
        }
}

//==============================================================================
/**
 * @brief  Memory to memory callback.
 *
 * @param  SR           status
 * @param  arg          argument
 *
 * @return True if yield needed, false otherwise.
 */
//==============================================================================
static bool M2M_callback(DMA_Stream_TypeDef *stream, u8_t SR, void *arg)
{
        UNUSED_ARG1(stream);

        bool yield = false;
        int  err   = (SR & DMA_SR_TCIF) ? ESUCC : EIO;

        sys_queue_send_from_ISR(arg, &err, &yield);

        return yield;
}

//==============================================================================
/**
 * @brief Function handle DMA IRQ.
 *
 * @param  major        DMA number
 * @param  stream       stream number
 */
//==============================================================================
static void IRQ_handle(u8_t major, u8_t stream)
{
        DMA_Stream_TypeDef *DMA_Stream = DMA_HW[major].stream[stream];
        DMA_RT_stream_t    *RT_stream  = &DMA_RT[major]->stream[stream];

        bool  yield = false;
        u32_t LISR  = DMA_HW[major].DMA->LISR;
        u32_t HISR  = DMA_HW[major].DMA->HISR;

        u32_t SR = stream < 4 ? LISR : HISR;

        switch (stream % 4) {
        case 0: SR >>=  0; break;
        case 1: SR >>=  6; break;
        case 2: SR >>= 16; break;
        case 3: SR >>= 22; break;
        }

