devdnl/dnx-rtos/src/system/drivers/dma/stm32f4/dma.c
        if (RT_stream->callback) {
                yield = RT_stream->callback(DMA_HW[major].stream[stream],
                                            SR & 0x3F, RT_stream->arg);
        }

        if (!(DMA_Stream->CR & DMA_SxCR_CIRC)) {
                DMA_Stream->CR = 0;

                RT_stream->callback = NULL;
                RT_stream->arg      = NULL;

                if (RT_stream->release) {
                        RT_stream->dmad    = 0;
                        RT_stream->release = false;
                }

                /*
                 * Writing EN bit to 0 is not immediately effective since it is
                 * actually written to 0 once all the current transfers have finished.
                 * When the EN bit is read as 0, this means that the stream is
                 * ready to be configured. It is therefore necessary to wait for
                 * the EN bit to be  cleared before starting any stream configuration.
                 */
                while (DMA_Stream->CR & DMA_SxCR_EN);
        }

        clear_DMA_IRQ_flags(major, stream);

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief DMA1 Stream 0 IRQ.
 */
//==============================================================================
void DMA1_Stream0_IRQHandler(void)
{
        IRQ_handle(0, 0);
}

//==============================================================================
/**
 * @brief DMA1 Stream 1 IRQ.
 */
//==============================================================================
void DMA1_Stream1_IRQHandler(void)
{
        IRQ_handle(0, 1);
}

//==============================================================================
/**
 * @brief DMA1 Stream 2 IRQ.
 */
//==============================================================================
void DMA1_Stream2_IRQHandler(void)
{
        IRQ_handle(0, 2);
}

//==============================================================================
/**
 * @brief DMA1 Stream 3 IRQ.
 */
//==============================================================================
void DMA1_Stream3_IRQHandler(void)
{
        IRQ_handle(0, 3);
}

//==============================================================================
/**
 * @brief DMA1 Stream 4 IRQ.
 */
//==============================================================================
void DMA1_Stream4_IRQHandler(void)
{
        IRQ_handle(0, 4);
}

//==============================================================================
/**
 * @brief DMA1 Stream 5 IRQ.
 */
//==============================================================================
void DMA1_Stream5_IRQHandler(void)
{
        IRQ_handle(0, 5);
}

//==============================================================================
/**
 * @brief DMA1 Stream 6 IRQ.
 */
//==============================================================================
void DMA1_Stream6_IRQHandler(void)
{
        IRQ_handle(0, 6);
}

//==============================================================================
/**
 * @brief DMA1 Stream 7 IRQ.
 */
//==============================================================================
void DMA1_Stream7_IRQHandler(void)
{
        IRQ_handle(0, 7);
}

//==============================================================================
/**
 * @brief DMA2 Stream 0 IRQ.
 */
//==============================================================================
void DMA2_Stream0_IRQHandler(void)
{
        IRQ_handle(1, 0);
}

//==============================================================================
/**
 * @brief DMA2 Stream 1 IRQ.
 */
//==============================================================================
void DMA2_Stream1_IRQHandler(void)
{
        IRQ_handle(1, 1);
}

//==============================================================================
/**
 * @brief DMA2 Stream 2 IRQ.
 */
//==============================================================================
void DMA2_Stream2_IRQHandler(void)
{
        IRQ_handle(1, 2);
}

//==============================================================================
/**
 * @brief DMA2 Stream 3 IRQ.
 */
//==============================================================================
void DMA2_Stream3_IRQHandler(void)
{
        IRQ_handle(1, 3);
}

//==============================================================================
/**
 * @brief DMA2 Stream 4 IRQ.
 */
//==============================================================================
void DMA2_Stream4_IRQHandler(void)
{
        IRQ_handle(1, 4);
}

//==============================================================================
/**
 * @brief DMA2 Stream 5 IRQ.
 */
//==============================================================================
void DMA2_Stream5_IRQHandler(void)
{
        IRQ_handle(1, 5);
}

//==============================================================================
/**
 * @brief DMA2 Stream 6 IRQ.
 */
//==============================================================================
void DMA2_Stream6_IRQHandler(void)
{
        IRQ_handle(1, 6);
}

//==============================================================================
/**
 * @brief DMA2 Stream 7 IRQ.
 */
//==============================================================================
void DMA2_Stream7_IRQHandler(void)
{
        IRQ_handle(1, 7);
}

/*==============================================================================
  End of file
==============================================================================*/
